configXML/Documents/КурсыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КурсыОбучения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПрактическогоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПрохождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОбучающегосяОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КартинкиТекстовыхБлоков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТекстовогоБлока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекстовыеБлоки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаголовокТекстовогоБлока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТекстовогоБлока</Name>
							<Comment>Служебное поле</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныАнкет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

configXML/InformationRegisters/ДанныеКартинокТекстовыхБлоковКурсовОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКартинокТекстовыхБлоковКурсовОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеКартинки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АдресДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КурсОбучения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КурсыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТекстовогоБлока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configXML/InformationRegisters/ДанныеРеспондентовКурсовОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеРеспондентовКурсовОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОзнакомленияСТеорией</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполненияПрактическойЧасти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КурсОбучения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КурсыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configXML/Documents/КурсыОбучения/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Респондент = Пользователи.ТекущийПользователь();
		РежимАнкетирования = Перечисления.РежимыАнкетирования.Анкета;
		УстановитьОформлениеФормыПоРолям();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьТаблицуФормыКартинкиТекстовыхБлоков();
	
	Респондент = Пользователи.ТекущийПользователь();
	РежимАнкетирования = Перечисления.РежимыАнкетирования.Анкета;
	УстановитьОформлениеФормыПоРолям();
	
	ОбновитьОтображениеЭлементовКурсаДляОбучающихся();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Анкета" ИЛИ ИмяСобытия = "Проведение_Анкета" Тогда
		ТаблицаАнкетРеспондента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	АктуализироватьДанныеКартинокВРегистре(ТекущийОбъект.Ссылка, КартинкиТекстовыхБлоков.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФлагПредпросмотрТеорииПриИзменении(Элемент)
	ФлагПредпросмотрТеорииПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПоказатьКартинку(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПоказатьКартинкуАсинх(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаКурсДляОбучающихсяСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаПрактикаДляОбучающихсяСтраница Тогда
		ТаблицаАнкетРеспондента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАнкетПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ТаблицаАнкет.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.АнкетаОпрос) = Тип("ДокументСсылка.Анкета") Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ключ",ТекущиеДанные.АнкетаОпрос);
		СтруктураПараметров.Вставить("ТолькоФормаЗаполнения", Истина);
		СтруктураПараметров.Вставить("РежимАнкетирования", РежимАнкетирования);
		СтруктураПараметров.Вставить("Заголовок", ТекущиеДанные.Представление);
		ОткрытьФорму("Документ.Анкета.ФормаОбъекта", СтруктураПараметров, Элемент);
	ИначеЕсли ТипЗнч(ТекущиеДанные.АнкетаОпрос) = Тип("ДокументСсылка.НазначениеОпросов") Тогда
		СтруктураПараметров = Новый Структура;
		ЗначенияЗаполнения 	= Новый Структура;
		ЗначенияЗаполнения.Вставить("Респондент", Респондент);
		ЗначенияЗаполнения.Вставить("Опрос", ТекущиеДанные.АнкетаОпрос);
		ЗначенияЗаполнения.Вставить("РежимАнкетирования", РежимАнкетирования);
		СтруктураПараметров.Вставить("Заголовок", ТекущиеДанные.Представление);
		СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		СтруктураПараметров.Вставить("ТолькоФормаЗаполнения", Истина);
		ОткрытьФорму("Документ.Анкета.ФормаОбъекта", СтруктураПараметров, Элемент, ТекущиеДанные.Представление);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ТекстовыеБлокиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = ЭтаФорма.Элементы.ТекстовыеБлоки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Открываем форму редактирования текстового блока.
	ПараметрыОткрытияФормы = Новый Структура();
	
	ПараметрыОткрытияФормы.Вставить("ИдентификаторТекстовогоБлока", ТекущиеДанные.ИдентификаторТекстовогоБлока);
	ПараметрыОткрытияФормы.Вставить("ЗаголовокТекстовогоБлока", ТекущиеДанные.ЗаголовокТекстовогоБлока);
	ПараметрыОткрытияФормы.Вставить("КурсОбученияСсылка", Объект.Ссылка);
	ПараметрыОткрытияФормы.Вставить("Текст", ТекущиеДанные.Текст);
	// Для помещения картинок во временное хранилище с ключом формы-владельца.
	ПараметрыОткрытияФормы.Вставить("УникальныйИдентификаторВладельца", ЭтаФорма.УникальныйИдентификатор);
	
	// Соберем данные картинки и передадим в форму редактирования.
	ОписаниеКартинки = ПолучитьСтруктуруОписанияКартинки();
	ПараметрыОтбора = Новый Структура("ИдентификаторТекстовогоБлока", ТекущиеДанные.ИдентификаторТекстовогоБлока);
	НайденныеСтроки = ЭтаФорма.КартинкиТекстовыхБлоков.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеКартинки, НайденныеСтроки[0]);
	КонецЕсли;
	ПараметрыОткрытияФормы.Вставить("ОписаниеКартинки", ОписаниеКартинки);
	
	ИмяПроцедуры = "ПослеЗавершенияРедактированияТекстовогоБлока";
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	ОписаниеОповещения = Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Документ.КурсыОбучения.Форма.ФормаРедактированияТекстовогоБлока", ПараметрыОткрытияФормы, 
		ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗавершенияРедактированияТекстовогоБлока(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.ТекстовыеБлоки.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокСвойств = "ЗаголовокТекстовогоБлока,Текст,ИдентификаторТекстовогоБлока";
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат, СписокСвойств);
	
	Если Результат.Свойство("ДанныеКартинки") Тогда
		АктуализироватьТаблицуКартинокТекстовыхБлоков(Результат.ДанныеКартинки, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ТаблицаАнкетРеспондента();
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОзнакомление(Команда)
	
	ПодтвердитьОзнакомлениеНаСервере();
	Элементы.ГруппаКурсДляОбучающихсяСтраницы.ТекущаяСтраница = Элементы.ГруппаПрактикаДляОбучающихсяСтраница;
	
	ИмяПроцедуры = "ПослеНажатияНаУведомлениеОбУспешномОзнакомленииСТеорией";
	ОписаниеОповещения = Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект);
	ПоказатьОповещениеПользователя("Теория изучена.", ОписаниеОповещения, 
		"Вернуться к теории.",, СтатусОповещенияПользователя.Информация);

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВыполнениеКурса(Команда)
	
	Если ПустаяСтрока(Элементы.ДекорацияДатаОзнакомления.Заголовок) Тогда
		ТекстПредупреждения = "Перед выполнением практической части требуется подтвердить ознакомление с теорией.
							  |Установите отметку ""Ознакомлен"" в нижней части вкладки ""Теория"".";
		ПоказатьПредупреждение(, ТекстПредупреждения,, "Ознакомьтесь с теорией");
		Элементы.ГруппаКурсДляОбучающихсяСтраницы.ТекущаяСтраница = Элементы.ГруппаТеорияДляОбучающихсяСтраница;
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Если ТаблицаАнкет.Количество() <> 0 Тогда
		ТекстСообщенияПользователю = "Перед выполнением курса убедитесь, что все опросы пройдены.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияПользователю,, "ТаблицаАнкет",, Отказ);
	КонецЕсли;
	
	Если Объект.КомментарийОбучающегосяОбязателен = Истина И ПустаяСтрока(КомментарийОбучающегося) Тогда
		ТекстСообщенияПользователю = "Перед выполнением курса добавьте комментарий к выполнению.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияПользователю,, "КомментарийОбучающегося",, Отказ);
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПодтвердитьВыполнениеКурсаНаСервере();
	
	ИмяПроцедуры = "ПослеНажатияНаУведомлениеОВыполненииКурса";
	ОписаниеОповещения = Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект);
	ПоказатьОповещениеПользователя("Курс пройден.", ОписаниеОповещения, 
		"Ожидайте результатов!",, СтатусОповещенияПользователя.Информация);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуФормыКартинкиТекстовыхБлоков()

	РегистрСведенийМенеджер = РегистрыСведений.ДанныеКартинокТекстовыхБлоковКурсовОбучения;
	ДанныеКартинокКурса = РегистрСведенийМенеджер.ПолучитьДанныеКартинокПоКурсуОбучения(Объект.Ссылка);
	СтрокаНеограниченная = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(0));
	ДанныеКартинокКурса.Колонки.Добавить("АдресКартинки", СтрокаНеограниченная);
	
	Для Каждого СтрокаТаблицы Из ДанныеКартинокКурса Цикл
		ЗначенияКлюча = Новый Структура("КурсОбучения,ИдентификаторТекстовогоБлока", 
			Объект.Ссылка, СтрокаТаблицы.ИдентификаторТекстовогоБлока);
		КлючЗаписи = РегистрСведенийМенеджер.СоздатьКлючЗаписи(ЗначенияКлюча);
		СтрокаТаблицы.АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписи, "ДанныеКартинки");
	КонецЦикла;
	
	ДанныеКартинокКурса.Колонки.Удалить("ДанныеКартинки");
	
	КартинкиТекстовыхБлоков.Загрузить(ДанныеКартинокКурса);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеФормыПоРолям()

	ОтображатьНастройкиКурса = Пользователи.РолиДоступны("ДобавлениеИзменениеКурсовОбучения");
	
	Элементы.ФормаЗаписать.Видимость 			= ОтображатьНастройкиКурса;
	Элементы.ГруппаНастройкаКурса.Видимость 	= ОтображатьНастройкиКурса;
	Элементы.ГруппаНастройкаКурса.Доступность 	= ОтображатьНастройкиКурса;
	Элементы.ГруппаКурсДляОбучающихся.Видимость 	= НЕ ОтображатьНастройкиКурса;
	Элементы.ГруппаКурсДляОбучающихся.Доступность 	= НЕ ОтображатьНастройкиКурса;
	
	Если ОтображатьНастройкиКурса Тогда
		
		УстановитьТекстКолонкиКартинкиТаблицыТекстовыхБлоков();
		
		Элементы.ПодтвердитьОзнакомление.Доступность = Ложь;
		Элементы.ПодтвердитьВыполнениеКурса.Доступность = Ложь;
		
	Иначе
		УстановитьДоступностьЭлементовНаОснованииПрогрессаВыполненияКурса();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстКолонкиКартинкиТаблицыТекстовыхБлоков()

	Для Каждого СтрокаТаблицы Из Объект.ТекстовыеБлоки Цикл
		ПараметрыПоиска = Новый Структура("ИдентификаторТекстовогоБлока", СтрокаТаблицы.ИдентификаторТекстовогоБлока);
		НайденныеСтроки = КартинкиТекстовыхБлоков.НайтиСтроки(ПараметрыПоиска);
		ТекстИнформирования = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].ИмяФайла, "Нет картинки");
		СтрокаТаблицы.Картинки = ТекстИнформирования;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьТаблицуКартинокТекстовыхБлоков(ДанныеКартинки, ИдентификаторСтроки)

	НайденнаяСтрока = Объект.ТекстовыеБлоки.НайтиПоИдентификатору(ИдентификаторСтроки);
	ИдентификаторТекстовогоБлока = НайденнаяСтрока.ИдентификаторТекстовогоБлока;
	
	ПараметрыОтбора = Новый Структура("ИдентификаторТекстовогоБлока", ИдентификаторТекстовогоБлока);
	НайденныеСтроки = КартинкиТекстовыхБлоков.НайтиСтроки(ПараметрыОтбора);
	Если Не ПустаяСтрока(ДанныеКартинки.АдресКартинки) Тогда
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаДанныхКартинки = КартинкиТекстовыхБлоков.Добавить();
			СтрокаДанныхКартинки.ИдентификаторТекстовогоБлока = ИдентификаторТекстовогоБлока;
		Иначе
			СтрокаДанныхКартинки = НайденныеСтроки[0];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаДанныхКартинки, ДанныеКартинки, ПолучитьСписокСвойствСтруктурыОписанияКартинки());
		
	Иначе
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			КартинкиТекстовыхБлоков.Удалить(НайденныеСтроки[0]);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьТекстКолонкиКартинкиТаблицыТекстовыхБлоков();
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьДанныеКартинокВРегистре(КурсОбученияСсылка, ДанныеКартинокКурса)
	
	СтрокиУдалить = Новый Массив();
	
	ПараметрыОтбора = Новый Структура("ИдентификаторТекстовогоБлока");
	Для Каждого СтрокаТаблицы Из ДанныеКартинокКурса Цикл
		ПараметрыОтбора.ИдентификаторТекстовогоБлока = СтрокаТаблицы.ИдентификаторТекстовогоБлока;
		НайденныеСтроки = Объект.ТекстовыеБлоки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокиУдалить.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
		ДанныеКартинокКурса.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	РегистрСведенийМенеджер = РегистрыСведений.ДанныеКартинокТекстовыхБлоковКурсовОбучения;
	РегистрСведенийМенеджер.АктуализироватьДанныеКартинокВРегистре(КурсОбученияСсылка, ДанныеКартинокКурса);
	
КонецПроцедуры

&НаСервере
Процедура ФлагПредпросмотрТеорииПриИзмененииНаСервере()
	
	Если ЭтаФорма.ФлагПредпросмотрТеории = 1 Тогда
		ОбновитьОтображениеЭлементовКурсаДляОбучающихся();
		Элементы.Переместить(Элементы.ГруппаТеорияДляОбучающихся, 
							 Элементы.ГруппаНастройкаТеория);
	Иначе
		Элементы.Переместить(Элементы.ГруппаТеорияДляОбучающихся, 
							 Элементы.ГруппаТеорияДляОбучающихсяСтраница);
	КонецЕсли;
	
	Элементы.НастройкаТекстовыхБлоков.Видимость = (ЭтаФорма.ФлагПредпросмотрТеории = 0);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруОписанияКартинки()
	
	Результат = Новый Структура();
	
	Результат.Вставить("АдресКартинки", 	"");
	Результат.Вставить("ИмяФайла", 			"");
	Результат.Вставить("РазмерФайла", 		"");
	Результат.Вставить("РасширениеФайла", 	"");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокСвойствСтруктурыОписанияКартинки()
	Возврат "АдресКартинки,ИмяФайла,РазмерФайла,РасширениеФайла";	
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеЭлементовКурсаДляОбучающихся()
	
	ПрефиксШаблон 			= "Добавленный_";
	ШаблонЗаголовка 		= "ЗаголовокТекстовогоБлока_";
	ШаблонТекстовогоБлока 	= "ТекстовыйБлок_";
	ШаблонКартинки 			= "Картинка_";
	ШаблонГруппы 			= "ГруппаТекстовогоБлока_";
	ПрефиксПодчиненнойГруппы = "ПодГруппа_";
	
	ТипСтрокаНеогр = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(0));
	Разделитель = ",";
	
	УдаляемыеРеквизиты = СтрРазделить(ЭтаФорма.ИменаПрограммноДобавленныхРеквизитов, Разделитель, Ложь);
	ДобавляемыеРеквизиты 			= Новый Массив();
	МассивИменДобавленныхРеквизитов = Новый Массив();
	МассивИменДобавленныхЭлементов  = Новый Массив();
	
	ПосадочнаяГруппа = Элементы.ГруппаТеорияДляОбучающихся;
	
	// Удалим старые элементы формы
	Для Каждого ИмяЭлемента Из СтрРазделить(ЭтаФорма.ИменаПрограммноДобавленныхЭлементов, Разделитель, Ложь) Цикл
		Элементы.Удалить(ПосадочнаяГруппа.ПодчиненныеЭлементы.Найти(ИмяЭлемента));
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Объект.ТекстовыеБлоки Цикл
		
		ПорядковыйНомер = СтрокаТаблицы.НомерСтроки;
		
		// Добавляем реквизит заголовка
		ИмяРеквизитаЗаголовка = ПрефиксШаблон + ШаблонЗаголовка + ПорядковыйНомер;
		РеквизитЗаголовка = Новый РеквизитФормы(ИмяРеквизитаЗаголовка, ТипСтрокаНеогр,, ИмяРеквизитаЗаголовка);
		ДобавляемыеРеквизиты.Добавить(РеквизитЗаголовка);
		МассивИменДобавленныхРеквизитов.Добавить(ИмяРеквизитаЗаголовка);
		
		// Добавляем реквизит текстового блока
		ИмяРеквизитаТекстовогоБлока = ПрефиксШаблон + ШаблонТекстовогоБлока + ПорядковыйНомер;
		РеквизитТекстовогоБлока = Новый РеквизитФормы(ИмяРеквизитаТекстовогоБлока, ТипСтрокаНеогр,, ИмяРеквизитаТекстовогоБлока);
		ДобавляемыеРеквизиты.Добавить(РеквизитТекстовогоБлока);
		МассивИменДобавленныхРеквизитов.Добавить(ИмяРеквизитаТекстовогоБлока);
		
		ПараметрыОтбора = Новый Структура("ИдентификаторТекстовогоБлока", СтрокаТаблицы.ИдентификаторТекстовогоБлока);
		НайденныеСтроки = КартинкиТекстовыхБлоков.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			// Добавляем реквизит картинки
			ИмяРеквизитаКартинки = ПрефиксШаблон + ШаблонКартинки + ПорядковыйНомер;
			РеквизитКартинки = Новый РеквизитФормы(ИмяРеквизитаКартинки, ТипСтрокаНеогр,, ИмяРеквизитаКартинки);
			ДобавляемыеРеквизиты.Добавить(РеквизитКартинки);
			МассивИменДобавленныхРеквизитов.Добавить(ИмяРеквизитаКартинки);
		КонецЕсли;
		
		// Создаем группу текстового блока
		ИмяЭлементаГруппы = ПрефиксШаблон + ШаблонГруппы + ПорядковыйНомер;
		ГруппаФормы = Элементы.Добавить(ИмяЭлементаГруппы, Тип("ГруппаФормы"), ПосадочнаяГруппа);
		ГруппаФормы.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Отображение                = ОтображениеОбычнойГруппы.Нет;
		ГруппаФормы.ОтображатьЗаголовок        = Ложь;
		ГруппаФормы.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		МассивИменДобавленныхЭлементов.Добавить(ИмяЭлементаГруппы);
		
	КонецЦикла;
	
	ЭтаФорма.ИменаПрограммноДобавленныхРеквизитов = СтрСоединить(МассивИменДобавленныхРеквизитов, Разделитель);
	ЭтаФорма.ИменаПрограммноДобавленныхЭлементов = СтрСоединить(МассивИменДобавленныхЭлементов, Разделитель);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	// Заполним добавленные реквизиты формы значениями из строк таблицы
	Для Каждого СтрокаТаблицы Из Объект.ТекстовыеБлоки Цикл
		
		ИмяРеквизитаЗаголовка = ПрефиксШаблон + ШаблонЗаголовка + СтрокаТаблицы.НомерСтроки; 
		ЭтаФорма[ИмяРеквизитаЗаголовка] = СтрокаТаблицы.ЗаголовокТекстовогоБлока;
		ИмяРеквизитаТекстовогоБлока = ПрефиксШаблон + ШаблонТекстовогоБлока + СтрокаТаблицы.НомерСтроки;
		ЭтаФорма[ИмяРеквизитаТекстовогоБлока] = СтрокаТаблицы.Текст;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторТекстовогоБлока", СтрокаТаблицы.ИдентификаторТекстовогоБлока);
		НайденныеСтроки = КартинкиТекстовыхБлоков.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ИмяРеквизитаКартинки = ПрефиксШаблон + ШаблонКартинки + СтрокаТаблицы.НомерСтроки;
			ЭтаФорма[ИмяРеквизитаКартинки] = НайденныеСтроки[0].АдресКартинки;
		КонецЕсли;
		
	КонецЦикла;
	
	ШрифтЗаголовка = Новый Шрифт(, 16, Истина);
	ЦветЗаголовка = Новый Цвет(0, 150, 70);
	
	ПорядковыйНомер = 1;
	Для Каждого ИмяЭлементаГруппы Из МассивИменДобавленныхЭлементов Цикл
		
		// Элементы, соответствующие добавленным реквизитам. 
		// Их фиксировать не надо, т.к. при удалении элемента-владельца они удалятся сами.

		ГруппаФормы = Элементы.Найти(ИмяЭлементаГруппы);
				
		ИмяЭлементаЗаголовка = ПрефиксШаблон + ШаблонЗаголовка + ПорядковыйНомер;
		ЭлементЗаголовка = Элементы.Добавить(ИмяЭлементаЗаголовка, Тип("ДекорацияФормы"), ГруппаФормы);
		ЭлементЗаголовка.Вид					= ВидДекорацииФормы.Надпись;
		ЭлементЗаголовка.Заголовок 				= ЭтаФорма[ПрефиксШаблон + ШаблонЗаголовка + ПорядковыйНомер];
		ЭлементЗаголовка.Шрифт 					= ШрифтЗаголовка;
		ЭлементЗаголовка.ЦветТекста 			= ЦветЗаголовка;
		
		// Подгруппа для текста и картинки.
		ИмяЭлементаПодГруппы = ПрефиксШаблон + ПрефиксПодчиненнойГруппы + ШаблонГруппы + ПорядковыйНомер;
		ПодГруппаФормы = Элементы.Добавить(ИмяЭлементаПодГруппы, Тип("ГруппаФормы"), ГруппаФормы);
		ПодГруппаФормы.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
		ПодГруппаФормы.Отображение                = ОтображениеОбычнойГруппы.Нет;
		ПодГруппаФормы.ОтображатьЗаголовок        = Ложь;
		ПодГруппаФормы.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ИмяЭлементаТекстовогоБлока = ПрефиксШаблон + ШаблонТекстовогоБлока + ПорядковыйНомер;
		ЭлементТекстовогоБлока = Элементы.Добавить(ИмяЭлементаТекстовогоБлока, Тип("ДекорацияФормы"), ПодГруппаФормы);
		ЭлементТекстовогоБлока.Вид 				= ВидДекорацииФормы.Надпись;
		ЭлементТекстовогоБлока.Заголовок 		= ЭтаФорма[ПрефиксШаблон + ШаблонТекстовогоБлока + ПорядковыйНомер];
		ЭлементТекстовогоБлока.АвтоМаксимальнаяШирина = Ложь;
		ЭлементТекстовогоБлока.Ширина 			= 100;
		
		ИмяЭлементаКартинки = ПрефиксШаблон + ШаблонКартинки + ПорядковыйНомер;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, ИмяЭлементаКартинки) Тогда
			ПолеКартинки = Элементы.Добавить(ИмяЭлементаКартинки, Тип("ПолеФормы"), ПодГруппаФормы);
			ПолеКартинки.ПутьКДанным 			= ИмяЭлементаКартинки;
			ПолеКартинки.Вид 					= ВидПоляФормы.ПолеКартинки;
			ПолеКартинки.Гиперссылка 			= Истина;
			ПолеКартинки.Масштабировать 		= Истина;
			ПолеКартинки.АвтоМаксимальнаяВысота = Ложь;
			ПолеКартинки.РастягиватьПоВертикали = Истина;
			ПолеКартинки.РазмерКартинки 		= РазмерКартинки.Пропорционально;
			ПолеКартинки.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеКартинки.АвтоМаксимальнаяШирина = Ложь;
			ПолеКартинки.Ширина 				= 20;
			ПолеКартинки.УстановитьДействие("Нажатие", "Подключаемый_ПоказатьКартинку");
			
		КонецЕсли;
			
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПоказатьКартинкуАсинх(Элемент)
	
	АдресВоВременномХранилище = ЭтаФорма[Элемент.Имя];
	
	// Расширение файла
	ПараметрыОтбора = Новый Структура("АдресКартинки", АдресВоВременномХранилище);
	НайденныеСтроки = ЭтаФорма.КартинкиТекстовыхБлоков.НайтиСтроки(ПараметрыОтбора);
	РасширениеФайла = НайденныеСтроки[0].РасширениеФайла;
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);
	Ждать ПолучитьФайлССервераАсинх(АдресВоВременномХранилище, ПутьКФайлу);
	
	Попытка
		
		ЗапуститьПриложениеАсинх(ПутьКФайлу);
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		МенеджерОбработкиОшибок = Новый МенеджерОбработкиОшибок();
		ТекстОшибки = "Не удалось открыть картинку по причине:" + Символы.ПС 
			+ МенеджерОбработкиОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ПоказатьПредупреждение(, ТекстОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаАнкетРеспондента()
	
	ТаблицаАнкет.Очистить();
	
	ПолученнаяТаблицаАнкет = Анкетирование.ТаблицаДоступныхРеспондентуАнкет(Респондент);
	
	Если ПолученнаяТаблицаАнкет <> Неопределено Тогда
		
		Для каждого СтрокаТаблицы Из ПолученнаяТаблицаАнкет Цикл
			
			// {
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы.АнкетаОпрос, "Основание")
			 И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.АнкетаОпрос, "Основание") <> Объект.Ссылка Тогда
				Продолжить;
			КонецЕсли;	
			// }
			
			НоваяСтрока = ТаблицаАнкет.Добавить();
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.АнкетаОпрос) Тогда
				
				НоваяСтрока.Представление = СтрокаТаблицы.Статус;
				НоваяСтрока.Статус        = СтрокаТаблицы.Статус;
				
			Иначе
				
				НоваяСтрока.Статус        = СтрокаТаблицы.Статус;
				НоваяСтрока.АнкетаОпрос   = СтрокаТаблицы.АнкетаОпрос;
				НоваяСтрока.Представление = ПолучитьПредставлениеСтрокиДереваАнкеты(СтрокаТаблицы);
				
			КонецЕсли;
			
			НоваяСтрока.КодКартинки = ?(СтрокаТаблицы.Статус = "Опросы",0,1);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует представление строки для дерева анкет.
//
// Параметры:
//  СтрокаДерева  - СтрокаДереваЗначений - на основании ее формируется представление 
//                 анкет и опросов в дереве.
//
&НаСервере
Функция ПолучитьПредставлениеСтрокиДереваАнкеты(СтрокаДерева)
	
	Если ТипЗнч(СтрокаДерева.АнкетаОпрос) = Тип("ДокументСсылка.НазначениеОпросов") Тогда
		Если ЗначениеЗаполнено(СтрокаДерева.ДатаОкончания) Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"", к заполнению до %2'"),
				СтрокаДерева.Наименование, Формат(НачалоДня(КонецДня(СтрокаДерева.ДатаОкончания) + 1), "ДЛФ=D"));
		Иначе	
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1""'"), СтрокаДерева.Наименование);
		КонецЕсли;
	ИначеЕсли ТипЗнч(СтрокаДерева.АнкетаОпрос) = Тип("ДокументСсылка.Анкета") Тогда
		Если ЗначениеЗаполнено(СтрокаДерева.ДатаАнкеты) И ЗначениеЗаполнено(СтрокаДерева.ДатаОкончания) Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"", последний раз редактировали %2, к заполнению до %3'"), 
				СтрокаДерева.Наименование, Формат(СтрокаДерева.ДатаАнкеты, "ДЛФ=D"),
				Формат(НачалоДня(КонецДня(СтрокаДерева.ДатаОкончания) + 1), "ДЛФ=D"));
		ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.ДатаАнкеты) Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"", последний раз редактировали %2'"), 
				СтрокаДерева.Наименование, Формат(СтрокаДерева.ДатаАнкеты, "ДЛФ=D"));
		Иначе
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1""'"), СтрокаДерева.Наименование);
		КонецЕсли;
	КонецЕсли;
	Возврат "";
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовНаОснованииПрогрессаВыполненияКурса()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПустаяСтрока = "";
	ФорматДаты = "ДЛФ=DDT";
	
	ДанныеПрохожденияКурса = ПолучитьДанныеПрохожденияКурсаРеспондентом(Объект.Ссылка, Респондент);
	
	Элементы.ДекорацияДатаОзнакомления.Заголовок = ПустаяСтрока;
	Элементы.ДекорацияДатаВыполнения.Заголовок = ПустаяСтрока;
	
	Если ЗначениеЗаполнено(ДанныеПрохожденияКурса.ДатаОзнакомленияСТеорией) Тогда
		Элементы.ПодтвердитьОзнакомление.Пометка = Истина;
		Элементы.ПодтвердитьОзнакомление.Доступность = Ложь;
		Элементы.ДекорацияДатаОзнакомления.Заголовок = Формат(ДанныеПрохожденияКурса.ДатаОзнакомленияСТеорией, ФорматДаты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПрохожденияКурса.ДатаВыполненияПрактическойЧасти) Тогда
		Элементы.ПодтвердитьВыполнениеКурса.Пометка = Истина;
		Элементы.ГруппаПрактикаДляОбучающихся.Доступность = Ложь;
		Элементы.ДекорацияДатаВыполнения.Заголовок = Формат(ДанныеПрохожденияКурса.ДатаВыполненияПрактическойЧасти, ФорматДаты);
	КонецЕсли;
	
	Если Объект.КомментарийОбучающегосяОбязателен = Истина Тогда
		Элементы.КомментарийОбучающегося.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	КомментарийОбучающегося = ДанныеПрохожденияКурса.Комментарий;
	
	Элементы.ГруппаДекорацияКурсПройден.Видимость = ЗначениеЗаполнено(ДанныеПрохожденияКурса.ДатаОзнакомленияСТеорией)
		И ЗначениеЗаполнено(ДанныеПрохожденияКурса.ДатаВыполненияПрактическойЧасти);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПрохожденияКурсаРеспондентом(КурсОбучения, Респондент)
	
	Регистр = РегистрыСведений.ДанныеРеспондентовКурсовОбучения;
	Возврат Регистр.ПолучитьДанныеПрохожденияКурсаРеспондентом(КурсОбучения, Респондент);
	
КонецФункции

&НаСервере
Процедура ПодтвердитьОзнакомлениеНаСервере()

	УстановитьДатуОзнакомленияРеспондентаСКурсом(Объект.Ссылка, Респондент);
	УстановитьДоступностьЭлементовНаОснованииПрогрессаВыполненияКурса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДатуОзнакомленияРеспондентаСКурсом(КурсОбучения, Респондент)

	Регистр = РегистрыСведений.ДанныеРеспондентовКурсовОбучения;
	Регистр.УстановитьДатуОзнакомленияРеспондентаСКурсом(КурсОбучения, Респондент);
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьВыполнениеКурсаНаСервере()
	
	УстановитьДатуВыполненияКурсаРеспондентом(Объект.Ссылка, Респондент, КомментарийОбучающегося);
	УстановитьДоступностьЭлементовНаОснованииПрогрессаВыполненияКурса();
	УведомитьАвтораКурсаОВыполненииСПомощьюЗадания();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДатуВыполненияКурсаРеспондентом(КурсОбучения, Респондент, КомментарийРеспондента)
	
	Регистр = РегистрыСведений.ДанныеРеспондентовКурсовОбучения;
	Регистр.УстановитьДатуВыполненияКурсаРеспондентом(КурсОбучения, Респондент, КомментарийРеспондента);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеНажатияНаУведомлениеОбУспешномОзнакомленииСТеорией(Результат) Экспорт
	Элементы.ГруппаКурсДляОбучающихсяСтраницы.ТекущаяСтраница = Элементы.ГруппаТеорияДляОбучающихсяСтраница;
КонецПроцедуры

&НаКлиенте
Процедура ПослеНажатияНаУведомлениеОВыполненииКурса(Результат) Экспорт
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура УведомитьАвтораКурсаОВыполненииСПомощьюЗадания()
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
